from tomato import Tomato
from tomato_bush import TomatoBush
from gardener import Gardener

if __name__ == '__main__':
    pass

    # ```
    # выполнить следующие задания:
    # 1. Создать несколько объектов класса TomatoBush,
    #    в каждом из которых будет минимум по 2 помидора
    # 2. Создайте объект Gardener, в который передать объекты, созданные в п.1
    # 3. Используя объект класса Gardener, поухаживайте за кустом с помидорами
    # 4. Попробуйте собрать урожай
    # 5. Если томаты еще не дозрели, продолжайте ухаживать за ними
    # 6. Соберите урожай
    # 7. Вывести сообщение о том, сколько томатов собрали